[
    {
        "videoId": 1,
        "video_title": "Introduction Art Of Coaching",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "مفهوم التوجيه أو  الكوتشنج معناه كمدير لازم هتكون بتعتمد في إنجاز المهام اللي عندك على أعضاء فريقك، هما اللي بيقدروا يوصلوك للنتيجة اللي انت عاوزها ، عشان كده المهارات اللي عند أعضاء  فريقك حاجة مهمه واساسيه بالنسبة لك كقائد للفريق. القادة اللي بيوجهوا أعضاء فرقهم  باستمرار بيساعدوهم و بيساعدوا نفسهم وشركاتهم كمان على المدى المتوسط و البعيد، وده اللي بيخليهم يوصلوا لنجاحات كتير غير مسبوقة. معنى كده ان المديرين أو الـleaders  اللي مش بيعملوا كده؟ بيفوتوا فرصة عظيمة للتغيير اللي ممكن يسيب أثر إيجابي في حياتهم و حياة غيرهم، وفيه أبحاث كتير أكدت  الكلام ده. فكل شركة ممكن إنها تستفيد لو تبنت ثقافة التوجيه  أو الـ coaching  بين مديرينها فهي كده بتستثمر فيهم و في أفراد التيمز بتاعتهم. لكن المشكلة الحقيقية إن الشركات بتفترض إن القادة و المديرين عندهم مهارات التوجيه أو الـ coaching بالفعل وبالتالي بياخدوا الموضوع  ده كشيء مسلم به وبالتالي بيعتمد بشكل كبير عليك أنت كمدير أو team leader. الحقيقة  اللي ناس كتير متعرفهاش هي أن التوجيه موضوع واسع جدا أكبر من مجرد تقديم الملاحظات والتقييمات. فالتوجيه  فيه مجموعة متنوعة من المهارات. أولا، ممكن تستخدمه لتطوير الموظفين بشكل منظم و مستمر. ثانيا، ممكن نعلي قدرتهم على الإنتاج بشكل كبير، ثالثا، تدعم تطلعاتهم المهنية وإعدادهم للمستوى التالي. و ده طبعا شيء قوي جدا. في الكورس ده، هتتعلم مهارات التوجيه اللي ممكن تخليك قائد أقوى وأكثر فاعلية ومستعد لبناء مهارات فريقك بطرق استراتيجية. و هتلاقي كمان أدوات ونماذج ملموسة توجهك و تساعدك إنك تنفذ الكلام ده بالفعل على أرض الواقع. أنا  شريف طه medical doctor, financial and business consultant و اللي هكون معاك في كورس the art of coaching يللا نبدأ الكورس."
            }
        ]
    },
    {
        "videoId": 2,
        "video_title": "Introducing The Coaching Concept",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "معظم الناس في مرحلة ما من حياتهم، إتدربوا على رياضة ما أو لعبة أو مهارة معينة. مفهوم الـ coaching أو التوجيه  بشكل عام، دايما بيرتبط في أذهاننا بالتوجيهات اللي ممكن تتقال وقت التدريب على رياضة أو لعبة أو أي مهارة تانيه. بس الموضوع بيبقى غامض شوية في بيئة الأعمال لما بنحاول نميز بين التوجيه أو الـ coaching حتى في الشغل نفسه. عشان كده، خلونا نبدأ بتوضيح الحاجات دي عشان نفك الغموض ده."
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "الـ coaching هو كل شيء عن تعليم المهارات بهدف مساعدة الموظفين على اكتساب المهارات التي بيحتاجوها لأداء وظائفهم بشكل أفضل. التوجيه لازم يكون فيه الدعم والمشورة على مستوى عالي. فا احنا لازم نبدأ بتدريب الموظف بشكل إستراتيجي على مهارة محددة ثم بعد كده ننتقل لمهارة تانيه و نفضل نوجههم لتحقيق إمكاناتهم الكاملة وإعدادهم للنجاح في المستوى اللي بعديه. وعشان نبقى منظمين خلال الكورس، خلونا نتفق على خمس مبادئ  للـ coaching. أولاً، الـ coaching بيركز على حاجتين  هم المدى القصير وده بنسميه تحسين الأداء، وعلى المدى الطويل وده بنسميه تطوير الأداء."
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "وبيكون الـ coaching على المدى القصير بغرض تحسين ومساعدة الموظفين على أنهم يبقوا أكثر فاعلية في وظيفتهم الحالية ، ومعالجة المشكلات السلوكية أو الشخصية اللي ممكن تعطل أهدافهم، وتوضيح التوقعات، ومناقشة ايه اللي هيترتب عليها  فيما بعد."
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "إنما ال coaching على المدى البعيد بيكون  بغرض التطوير و بيركز على تطوير الأداء بيجهز الموظفين للمستقبل، وبيعرفهم نقاط قوتهم، وبيوضح رؤيتهم المهنية الطويلة الأجل. فاالقادة هنا بيساعدوهم على تحديد وتوضيح أهدافهم ، و بالتالي بيساعدوهم على اكتساب المهارات والخبرات اللي هيحتاجوها للمستقبل."
            },
            {
                "viewIndex": 5,
                "paragraphDetails": "ثاني مبدأ، أن الـ coaching علاقة وليس حدثًا. يعني إيه؟ يعني بدلاً من التفكير في الـ coaching  كروتين أو إلتزام، المفروض تفكر فيه على إنه مستمر وتفاعلي فهو عملية مستمرة تقوم على الصدق والثقة و علاقة ممتدة للحصول على الدعم المستمر."
            },
            {
                "viewIndex": 6,
                "paragraphDetails": "ثالث مبدأ، أن ممكن يكون الـ coaching  رسمي أو غير رسمي. يعني مش لازم في قاعة الإجتماعات أو حتى في الشركة نفسها. ساعات ده بيخلي ال coach و ال coachee  أكثر راحة أثناء التدريب."
            },
            {
                "viewIndex": 7,
                "paragraphDetails": "رابع مبدأ، أن الـ coaching  لا يتعلق بتوفير جميع الإجابات. يعني دور الـ coach مش إجابة الأسئلة اللي بيسألها الـ coachee و لكن مساعدته وتوجيهه إنه يلاقي الإجابات للأسئلة دي و غيرها."
            },
            {
                "viewIndex": 8,
                "paragraphDetails": "خامس مبدأ والأخير، هو أن  الـ coaching مش هو الحل الصحيح لكل موقف. لأنه  بيتطلب وقت، ومش دايما هيكون الوقت متوفر. يعني المدير في بعض الأحيان بيحتاج ياخد القرارات ويدي الأوامر عشان الشغل يمشي. لو قدرت تفهم  تعريف وسياق الـ coaching  ده هيخلي عندك ميزة و إنت بتبدأ مسيرتك في عالم الإدارة و بتتقدم خطوة ورا خطوة."
            }
        ]
    },
    {
        "videoId": 3,
        "video_title": "The Importance Of Coaching",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "في البداية و قبل ما نقوم بعملية الـ coaching لازم نسأل نفسنا بعض الأسئلة عشان نحدد أهميه الـ coaching على كل المستويات ؟ اول سؤال، هو ايه  فايدته للموظف؟ الجواب الواضح هو النمو في مهاراته، بس هو أكثر من كده بكثير. لما بيتم ال coaching الموظف، بيحس إن موهبته بيتم الاعتراف بيها واحترام إمكانياته. يعني حافز ضخم لو اتعمل صح."
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "ثانيا، إيه الشيء اللي ممكن أعمله عشان أخلى الcoaching بتاعي يتيح للموظف إنه يكتشف الحاجات المختلفة و المتميزة و المثيرة في شغلهم؟"
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "ثالثاً إزاي اساعدهم بشكل أفضل إنهم يكتشفوا نقط قوتهم و يستغلوها للوصول للمزيد من النجاح، مش بس ادربهم و أوجههم بخصوص النقط اللي محتاجة للتحسن. و الطريقة دي على فكرة، بتزود بشكل كبير الرضا الوظيفي عندهم."
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "رابعاً، إزاي أنا أستفيد كـ coach ؟ علاقه الـ coaching فيها فوائد هايلة للمدربين نفسهم. لأن  التدريب بيسمح للقادة بالتركيز في منطقة واحدة محددة من العمل وإحداث فرق حقيقي لأنهم في الوقت ده بيضطروا يدخلوا في تفاصيل كتير. وبدلاً من التوجيه، بيتحولوا في اللحظة دي لمتعاونين و مساعدين. فالـ coaching كمان بيخلي القادة يبنوا علاقات قوية مع أعضاء الفريق."
            },
            {
                "viewIndex": 5,
                "paragraphDetails": "خامسا، إيه الفايدة اللي هتعود على الشركة نفسها من تطبيق ثقافة الـ coaching؟ في الواقع، الشركة هتستفيد أكثر من أي حد تاني. أثبت التدريب أن ليه تأثيرًا هايل. علاقات فريق قوية تؤدي إلى الروح المعنوية الإيجابية. بيزيد اتصال الموظفين بقادتهم. بيزيد ولاء الموظفين للشركة، و طبعا ده بيحسن من الإحتفاظ بيهم و طبعا بيخفض تكلفة التوظيف والتدريب. التأثير التراكمي كل العوامل دي هو زيادة الأداء. عشان كده الشركات الكويسة بتؤمن بالتدريب. عشان كده أنا بسألكم هل التدريب يستحق ذلك؟ بدون أدنى شك. الشركات والمديرين اللي هيخلوا التدريب أولوية هيكسبوا مكاسب كتير و بشكل دائم."
            }
        ]
    },
    {
        "videoId": 4,
        "video_title": "Common Coaching Challenges",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "الشركات اللي بتتبنى ثقافة الـ coachingبتكسب كتير على المدى القصير و المتوسط و الطويل. ولكن في تحديات بنواجهها في الموضوع ده لأن برضو الدنيا مش بتمشي ببساطة من أشهر التحديات دي الوقت الوقت، وعدم وجود ما يكفي منه يعتبر تحدي لترتيب الأولويات. لازم تسأل نفسك إيه المهام اللي ممكن تفريغها أو تفويضها لحد تأني عشان تقدر تفضي لنفسك كل أسبوع شوية ساعات عشان تعمل جلسات الـ coaching الرسمية؟ بمجرد تخصيص الوقت ده، ممكن تزود شوية وقت للـ coaching غير الرسمي في أثناء تفاعلاتك مع الموظفين في النشاطات اليومية. إذا استثمرت وقتك وطاقتك، فأنت الكسبان على المدى البعيد."
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "تاني تحدي هو نقص الـ formal coaching أو التوجيه الرسمي. بعض القادة بيفتكروا إن التوجيه الغير رسمي اللي بييجي كده في وسط نشاطات الشغل اليومية كفاية و بيؤدي الغرض. غير متصورين إن الـ coaching لازم يكون ليهم وقت رسمي يتم التعامل معاه بجدية من ناحية الشركة و المدير و الموظف. ده كمان بيساعد على اتباع نموذج التوجيه كإطار ثابت بيخلي تأثيرك يزيد و ال coachee في كل مرة يبني على اللي اتعلمه في المرة اللي قبلها."
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "التحدي التالت هو تنافس أدوار المدير نفسها على طاقته و تركيزه ووقته. يعنى إيه الكلام ده؟ يعني ان القائد بيكون له أدوار كتير، فهو خبير استراتيجي، مدير، صاحب رؤية، حلال لمشاكل الفريق، و حاجات تانية كتير. من المنطقي جدا إن الأدوار دي نفسها بتاخد من طاقتك و هي نفسها بتتنافس على وقتك، سواء خلال اليوم أو حتى خلال الساعة الواحدة. عشان كده لو عاوز الـ coaching يكون  فعال ، لازم الموظف اللي قاعد قدامك يحس إنك بتركز عليه، وإنك مهتم فعلا بتقدمه و نجاحه في وظيفته. و ده هو الاتصال العاطفي اللي بيخلي للتدريب قيمة وبيبني علاقة إيجابية."
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "رابعا و ده أصعب تحدي مقاومة الموظفين أصعب شيء التعامل مع الإنسان الصعب. نظريا، المفروض الموظف يشوف الـ coaching  فرصة للنمو و التحرك للأمام في الشركة و إنه فرصة لتنمية مهاراته. و لكن مش شرط الموظف يكون مدرك الكلام ده على أرض الواقع. لو قدامك موظف محبط، هقول لك على شوية حاجات هتساعدك. أهم حاجة إنك تبذل قصارى جهدك في إنك تحافظ على موقف إيجابي لأنك لو رحت كل جلسة coaching بموقف مهزوم قبل ما تبدأ، مش هتعرف تدي قوة دفع لنفسك و لفريقك. افترض دايما أنك تقدر تساعد وإن اللي هتقوله ممكن يعمل فرق. حاول تأجيل الحكم لأن ممكن يكون عندك إنطباع سلبي عن الموظف أو إنك سمعت تقارير عن سلوكه مخلياك متصور عنه فكرة معينة. كـ coach هدفك هو منع ردود الفعل غير المباشرة من إفساد حكمك. على فكرة، وظيفتك كـ coach إنك تلاقي الأفضل في الشخص وتقنعه بكده. خليك دايما متوقع شوية تحديات وإستعد إنك تتغلب عليها باستخدام بعض استراتيجيات المواجهة الذكية."
            }
        ]
    },
    {
        "videoId": 5,
        "video_title": "Coaching Models|Grow",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "دلوقتي هنتعرف على بعض نماذج عملية الـ coaching و أول نموذج هنتكلم عنه هو  نموذج grow وال grow  هما اختصار لأربع كلمات بالإنجليزي جي جول أو هدف آر ريالتي أو الواقع أو اوبشنز أو الخيارات دبليو ويل أو الإرادة الموديل أو النموذج ده صممه  جون ويتمور و اللي قارن أو شبه عملية الcoaching بإنك طالع رحلة."
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "فا في البداية بتحدد المكان اللي عايز تروحه وبعد كده بتحدد نقطة البداية الخاصة بيك وثم تستكشف طرق مختلفة لوجهتك اللي انت رايحها.وأخيرا تاخد قرار وتختار انهي أفضل مسار أو طريق للرحلة دي وأمته تبدأ فيها. خلينا نستكشف اكتر تفاصيل الخطوات الأربعة في نموذج grow."
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "أولا تحديد الهدف كـ coach جزء من عملك عشان تعرف تقيم إمكانات موظفينك هي إنك تحدد الهدف. و تحدد إيه هي  المهارات اللي محتاجينها لتحقيق أهدافهم على نطاق أوسع ، وايه اللي ممكن يحققوه، إذا دربتهم بشكل فعال، و لو فرضنا إنهم ملتزمين بالكلام ده بنسبة ١٠٠٪  و إزاي ممكن تقيس الكلام ده، لأن بمساعدتك الموظف هيحدد في النهاية هدفه و ده هيخلق عنده حافز قوي."
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "ثانياً تحديد نقطة البداية  فا لو ربطنا  الكلام ده بإستخدام نظام الجي بي أس أو سنظام الملاحة  الموجود في عربيتك، هتلاقي ان الهدف  اللي حددته هو الوجهة بتاعه الرحلة. ولا يمكن إن الجي بي إس يديك توجيهات إلا إذا كان عارف نقطة البداية، وده بالظبط الخطوة التانية ودي  انت ممكن تحددها عن طريق اسئلة زي إيه هي مقاييس الأداء الحالية لموظفينك؟ وهل بيتجاوزوا المعايير دي ولا بيقصروا؟ إيه هي مهاراتهم ومواهبهم؟ يعني فين موظفينك على الطريق في اللحظة دي ؟ وهل هم على بعد ٢٠ ولا ٣٠ ولا ١٠٠ كيلو من وجهتهم النهائية؟ المرحلة دي من العملية لازم يغلب عليها المصداقية والدقة.يعني حقائق وليس أحكام."
            },
            {
                "viewIndex": 5,
                "paragraphDetails": "ثالثا استكشاف الخيارات أو الأوبشنز بمجرد إنك تساعد الموظفين على تحديد هم فين بالضبط، و عاوزين يروحوا فين، يبقى جه  الوقت لإرشادهم في تحديد الطرق البديلة. لما بتكون في رحلة على الطريق، ممكن تختار أسرع مسار، أو أكثر الطرق المباشرة، أو المسار اللي فيه مناظر طبيعية مثلا. يعني عندك خيارات وكذلك أعضاء فريقك . حط في اعتبارك إن الموضوع لا يتعلق بإنك تديهم إجابة محددة، بس ضروري  تساعدهم على استكشاف جميع الخيارات المختلفة. شجعهم على الإبداع والتفكير في طرق غير عادية لحل مشاكلهم. ومع ذلك، في أوقات هتوجهم فيها من خلال تحديد توقعات الأداء الكي بي آيز. لأن طبعا المساءلة لا تزال تقود العملية."
            },
            {
                "viewIndex": 6,
                "paragraphDetails": "رابعا وأخيرا الإرادة أو اتخاذ القرار الويل أو دبليو. في المرحلة دي، الكوتش بيساعد الموظفين على ترجمة المناقشة إلى قرار. إختيار الخيار الأفضل في البدء زي بالظبط ما انك لازم  تضغط على جو على الجي بي إس وتبدأ رحلتك  وكده مع  تقدم الموظفين إلى الأمام، ممكن إن المدربين يعلموا الموظفين انهم إزاي يحددوا الحواجز أو التحديات بنفسهم ويتخطوها. وكده يكون الكوتش  ازال العقبات من الطريق، ويكون بيلعب دور مهم في تسريع الرحلة نحو النجاح. إذا كنت عاوز إنك تصبح أكثر فعالية كمدرب، فكر في إتباع الخطوات الأربعة دول الهدف و الواقع و الخيارات والإرادة. إلى جانب مساعدة موظفينك على النمو، هتبنى إسلوب تدريب أهدافه واضحة و ممكن أن يحقق نتائج رائعة ليك و لفريقك و لشركتك"
            }
        ]
    },
    {
        "videoId": 6,
        "video_title": "Coaching Models Ppe",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "واحد من نماذج الكوتشنج هو نموذج الـ ppe  وبي بي إي هم إختصار لثلاث كلمات بالإنجليزي بي بلان أو خطط بي بربير أو حضر إي إكسكيوت أو نفذ النوع ده من التوجيه بيعتمد في الأساس على جزء كبير هتعمله لوحدك قبل ما تقعد مع الموظف. لو حبينا شبهنا النوع ده برحلة، فأنت بتخطط للرحلة عن طريق جمع المعلومات عن المكان اللي انت مسافره و الإجراءات المطلوبة و التكاليف."
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "ثم بتحضر أدواتك و ده يختلف عن التخطيط، لأن التخطيط يكون على الورق، أما التحضير بيكون خطوة فعلية بتجمع فيها الحاجات اللي هتستخدمها زي جواز السفر و التأشيرات و الفلوس و الملابس و الشنط و خلافه."
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "ثم بتسافر وبعد كده  بتنفذ خطتك اللي انت كاتبها مسبقا كزيارات و تسوق و خروج و كده كذلك الحال في العملية دي، الأول فأنت الاول بتحدد أهدافك في العمل و بالتالي الأهداف التوجيهية اللي هتحكم بيها على نجاحك مع الموظف و نجاحه هو أيضا في الوصول لمستوى أفضل."
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "ثم بتحضر تقاريرك و الموعد اللي هتعملوا فيه الاجتماع ده عشان الـ coaching و تحضر المكان. و الأهم من كل ده، بتحضر الموظف نفسيا عن طريق إنه يبقى دايما بيتطلع لليوم بتاع التوجيه بأمل وسعادة و يبقى عارف إنه هيتعلم حاجة جديدة هتساعده في شغله و إن ده شيء مفيد لمستقبله على المدى القصير و المتوسط و البعيد."
            },
            {
                "viewIndex": 5,
                "paragraphDetails": "و أخيراَ، بتنفذ التدريب وفقا للخطة اللي انت حطيتها و الأهداف اللي إنت رسمتها. و بتعيد العملية دي في كل مرة بس بتكون أبسط لأن عقلك خلاص تبرمج على الشكل ده و كمان بقيت حافظ نقاط التوجيه اللي إنت عاوز تشتغل عليها مع الفريق بتاعك جرب الموديل ده و هتلاقي إن من أكبر فوايده انه هيشيل الضغط من عليك و هيحطه على الورق و كمان هيساعدك في تخصيص وقت التوجيه بسهولة من غير ما يغير من جدول أعمالك"
            }
        ]
    },
    {
        "videoId": 7,
        "video_title": "Coaching Models Oskar",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "نموذج أوسكار يعتبر من أكثر نماذج التوجيه شيوعا و استخداما، لأنه بيركز على حل المشكلات مش على المشكلات نفسها. مبدأيا، والنموذج ده من إبتكار مارك مكرجو و نشره في كتابه المشهور التركيز على الحلول تسهيل التغيير و التوجيه وكل حرف بيدل على كلمة معينة"
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "بي بي إي هم اختصار لثلاث كلمات بالإنجليزي أو أوتكام أو النتيجة إس سكيل أو المقياس كيه إنوهاو أو الطريقة إيه أفيرم/أكشن أو التنفيذ آر ريفيو أو مراجعة والنموذج ده من إبتكار مارك مكرجو و نشره في كتابه المشهور التركيز على الحلول تسهيل التغيير و التوجيه."
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "أولا النتيجة أوتكام أو أوبجكتيف دايما بنبدأ بالهدف، و بنتفق مع الموظف على تحديد هدفنا من البداية و مواجهة المشكلة. ولازم يكون عندنا إتفاق و تعريف للمشكلة قبل ما نبدأ في أي خطوة تانية. يعني مثلا لو إنت بتواجه مشكلة في إسلوب تواصل حد من موظفينك و هو عنده مشكلة في الثقة بالنفس، ممكن تحولوا الهدف إلى هدف مشترك و هو النجاح في التواصل مع الأخرين و ده هيحل المشكلتين و هيخلي الموظف واثق من نفسه و كمان مهارات التواصل هتتحسن عنده مع الوقت."
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "ثانياً المقياس سكيل ده هيكون المقياس الموحد المتفق عليه بينكم للحكم على مستوى التقدم في الأداء. يعني مثلا هنحدد إن الموظف دلوقت على مستوى ٤ من ١٠ في مهارة معينة و في كل مرة هنشوف التقدم في الأداء وصل لحد كام. ففي مثال الموظف اللي هيحسن مهارات التواصل، لو هو دلوقت ٤ من ١٠، انت هتساعده و تشجعه و تعرفه دايما مستوى تقييمه و التحسن اللي بيحصل من خلال عملية التوجيه و التدريب."
            },
            {
                "viewIndex": 5,
                "paragraphDetails": "ثالثا الطريقة النوهاو بعد ما كونت فكرة عن وضع الموظف ده على مقياس المهارة و عرفت مستواه الحالي، الخطوة اللي بعدها إنكم تتفقوا على إيه هي الخطوات اللي هو محتاجها عشان يوصل للهدف اللي حددتوه. و بإستخدام السكيل أو المقياس إتفقوا إيه الخطوات اللي هتاخدوها للوصول للهدف ده."
            },
            {
                "viewIndex": 6,
                "paragraphDetails": "رابعاَ التنفيذ أكشن/أفيرم الخطوة دي ظريفة جدا لأنكم انتم الإتنين بتركزوا على الأشياء الكويسة اللي الموظف بيعملها و طبعا ده بيخلي الحوار ياخد شكل إيجابي و كمان بيحط نقطة الضعف في إطار مخفف، غير مباشر بيسهل تقبلها من ناحية المتدرب. يعني مثلا لو المتدرب على مستوى ٤ من ١٠، إسأله من وجهة نظرك إيه الحاجات الكويسة اللي عملتها للوصول للمستوى ده؟. و بعدها تسأله تفتكر ممكن تعمل إيه كمان يخليك توصل لمستوى أفضل؟ و بعدها تسأله إيه اللي ممكن الشركة تعمله لك لتحسين الأداء أو إزاي ممكن نساعدك؟ و هكذا. و تستمر في الأسئلة و الحوار حتى الوصول إلى إتفاق مشترك و تحطوه حيز التنفيذ"
            },
            {
                "viewIndex": 7,
                "paragraphDetails": "خامساَ المراجعة و التقييم ريفيو في بداية كل اجتماع أو جلسة من الإجتماعات دي، بتبدأ بإستعراض النتائج و التطور اللي حصل من أخر مرة و تقيم الأداء مقابل الأهداف الموضوعة مسبقا و مقابل أخر نتيجة كمان. أهم حاجة و أخطر حاجة و أشد حاجة هنا، أهم حاجة هنا هي إنك تركز على الإيجابيات قدر الإمكان. حتى لو كانت النتايج مش حلوة، حاول تشوف حاجة إيجابية تبدأ بيها مهمة كانت صغيرة، صعب جدا متلاقيش أي حاجة كويسة الموظف عملها تفتح بيها شباك التواصل. في النهاية، لو كنت بتحب بناء العلاقات و في نفس الوقت التركيز على النتائج القابلة للقياس، يبقى الموديل ده مناسب ليك و هيساعدك جدا"
            }
        ]
    },
    {
        "videoId": 8,
        "video_title": "Giving & Receiving Feedback",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "عاوزك تفتكر أمته أول مرة مديرك قال لك فيدباك سلبي. وهل لما حصل كده، كانت الكلمات المستخدمة لتسليم الرسالة واضحة و مفيهاش أحكام مسبقة عليك؟ وهل خدت الملاحظات أو الفيدباك ده بشكل هادف، ومش بشكل شخصي؟ خلي بالك إنك ممكن تكون بتقول ملاحظات قوية جدا للموظفين و ممكن يكون كلامك مظبوط جدا، بس الموظف لما يسمعه منك مياخدوش بالمعنى اللي انت عاوزه أو بالشكل الإيجابي اللي إنت متوقعه. فيه ست ٦ حاجات، لو عملتها، غالبا هتعرف توصل ملاحظاتك لفريقك بشكل فعال وإيجابي"
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "أولا خلي تعليقك محدد بدل ما يكون عام يعني مثلا متقولش إنت بتتعامل مع زملائك بطريقة مش كويسة و لكن قول ردودك على الزملاء في الاجتماعات بتبقى عنيفة و قول أمثلة يعني مثلا امبارح في اجتماع الفريق رديت على مجدي و اعترضت على فكرته وقولتله إنها فكرة سيئة مع ان كان ممكن تقول له ان فكرتك كويسه بس محتاجه تعديل وتضيف له عليها و إسمع منه وجهة نظره و بعد كده كمل معاه تاني في نفس الإتجاه بشكل مقنع وإيجابي."
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "ثانيا ماتفترضش إنك عارف الموظف قصده إيه أو بيفكر في إيه إسأل دايما و خليك مستمع جيد و إنت بتسمع الإجابة. ممكن تكون أصلا مكون فكرة غلط أو متعود على سلوك معين من الموظف فتتوقع منه المزيد من السلوك ده في حين إنه ممكن يكون يقصد شيء مختلف خالص عن اللي إنت متوقعه"
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "ثالثا  لازم ردود الفعل تكون في الوقت المناسب. يعني لو الموظف حقق نتيجة كويسة في شهر أكتوبر، متستناش لحد الريفيو اللي بعد شهرين و نفس الكلام لو كان الموظف عمل مشكلة أو تراجع أداؤه"
            },
            {
                "viewIndex": 5,
                "paragraphDetails": "رابعاَ  لازم ردود الفعل تكون هادفة. يعني أي ردود فعل بتقدمها لازم تركزعلى مساعدة الموظفين على التطوير أو النمو. قبل تقديم الاقتراحات أو النقد البناء ، اسأل نفسك، إيه هو الغرض من المعلومات دي؟ هل هي ذات صلة؟ هل ممكن تعمل فرق؟ من خلال الإجابة على الأسئلة دي و قبل البدء في تقديم الملاحظات، ممكن تحضر كلامك بطريقة مفيدة وموجهة."
            },
            {
                "viewIndex": 6,
                "paragraphDetails": "خامسا  لازم التعليقات تكون حذرة ودقيقة . يعني بلاش تقديم ملاحظات سلبية، وفي نفس الوقت لازم الموظفين يعرفوا المفروض يحسنوا إيه ويشتغلوا على إيه طيب إزاي أوصل ملاحظاتي؟ حافظ على عواطفك تحت السيطرة وخليك حذر مع اختيارات الكلمات. يعني مثلا إبدأ جملك بـ إحنا بدل إنت عشان تقلل الدفاع من طرف الموظف وهكذا. ودايما إبدأ بالإيجابيات"
            },
            {
                "viewIndex": 7,
                "paragraphDetails": "سادساً وأخيرا  الكوتشينج شيء مستمر. يعني يجب إنك تكون قادر تقدم ملاحظات في الوقت الفعلي سواء رسمي أو غير رسمي و ده هييجي مع الوقت و مع تطور علاقتك مع موظفينك. لما باستمرار تعليقاتك تكون هادفة ومحددة وفي الوقت المناسب، الموظفين هيطوروا بسرعة المهارات اللي هم محتاجينها لتحسين  حياتهم المهنية وحياتك إنت كمان."
            }
        ]
    },
    {
        "videoId": 9,
        "video_title": "Accountability & Active Listing",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "لازم نأكد على إن القائد لازم يكون  مهارات الـ coaching اللي عند أي شخص مسئول ومبتتهربش من المسئولية او بيرميها على حد من الفريق بس هنا هنتكلم عن إنك تساعد الموظف هو كمان يكون مسئول أدام نفسه و ادامك. وعشان كدة هنتكلم عن العناصر التلاتة للمسؤولية أول حاجة، الخطوات القادمة اللي الموظف إتفق معاك عليها. تاني حاجة، إمتى هينفذ كل خطوة من الخطوات دي؟ ثالث حاجة، الطريقة اللي هتخليه يقدر ينفذ الخطوات دي"
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "والكلام ده طبعا في منه خطوات بسيطة زي إنه هيتصل بعميل أو هيحضر اجتماع وطبعا في حاجات تانية أكثر تعقيدا زي إنه هيكتب خطة عمل أو هيحضر تدريب معين في الإدارة مثلاَ كل ما يكون الكلام ده مكتوب وكل ما تكون في تفاصيل أكتر مكتوبة، ده بيزود الإلتزام والإحساس بالمسئولية على الموظف. النقطة اللي تهمنا قوي هنا إن مش كل حاجة هتمشي تمام. يعني توقع تأخير أو تسويف أو عدم إلتزام لأن كل ده جزء من عملية التطوير. والمفروض إنك تحطه في جدول توجيهك للموظف. مع الوقت الموضوع ده هيفاجئك بنتايج أكتر مما تتوقع لدرجة إنك ساعات هتلاقي الفريق بتاعك هو نفسه ممكن يعمل خطة أحسن من اللي انت كنت هتحطها، أو حتى يحط هدف طموح أكتر من هدفك."
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "تاني مهارة من مهارات الـcoaching و اللي لازم تكون عند الـ coach هي الاستماع النشط طبعا عشان تعرف تفهم الفريق و توجهه مظبوط لازم تكون مستمع جيد، واكتر من كده تكون كمان مستمع نشط، بل و مستمع متعاطف لو إنت مش متعود إنك تستمع كويس، لازم تبدأ تعود نفسك على كده خلينا نقول ان  كلنا بننشغل بأحداث العمل اللي بتحصل حوالينا طول الوقت و مش بيبقى عندنا الوقت ولا الطاقة للإستماع بصبر و هدوء و تحليل اللي بيحصل و التركيز مع كل شخص على حدة."
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "بس لو عاوز تعمل نتايج استثنائية، يبقى برضو لازم تعمل حاجات إستثنائية. و بما إنك عملت جدول للـ coaching الرسمي، يبقى إنت وفرت الوقت للموضوع ده و فاضل بس إنك تعود نفسك على الإستماع بتفاعل و إهتمام للموظف بتاعك. حاول تسأل أسئلة مفتوحة و تسمع إجابة الموظف بإنصات قبل ما تفكر تتكلم أو ترد. يعني مثلا تسأله إيه رأيك نختار أي قرار ؟، بدلا من موافق على القرار ده ولا لأ؟ لو عودت نفسك على إنك تسمع أعضاء فريقك بصبر و بدون زهق هتعرف تشتغل معاهم بشكل أفضل و هيكون تأثيرك عليهم أكبر و هتوصلوا مع بعض لنتايج أقوى و أسرع"
            }
        ]
    },
    {
        "videoId": 10,
        "video_title": "Coaching Someone Who Is Older Than You",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "ممكن الموضوع يبقى محرج إلى حد ما في الأول بس خليني أقول لك بعض النصايح اللى هتساعدك جدا في الموقف ده. تخيل لو انت هتـ coach موظف معين. و خلينا نصعبها كمان عندك موظف و عاوز تعلمه قواعد العصف الذهني برينستورمنج. و إنت بتوجهه أثناء جلسة من الجلسات دي لقيت إن سلوكه في لا مبالاة وعدم اهتمام بوجودك و قيادتك للحوار. و لما بدأت تحاول تخليه يشارك بشكل مباشر و فيه مواجهة شوية فاجئك وسألك أنت عندك كام سنة؟. هتتصرف ازاي و هتعمل إيه عشان تبني قيمة و إحترام عند الشخص ده رغم إنه أكبر منك ب١٠ سنين مثلا؟ المهم هنا يكون رد فعلك يكون assertive أو حازم مش agressive أو عنيف."
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "و أهم من كده إن مع الوقت بتبدأ تبني القيمة تدريجيا من خلال الإنجازات اللي إنت هتعملها و التوجيه المستمر ليهم لغاية ما هم نفسهم  بغض النظر عن أعمارهم  يحسوا إنهم استفادوا واتعلموا منك بالفعل."
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "بس أنا بدأت بالسيناريو الصعب، لأن في معظم الأحوال، الأمور مش هتكون بالصعوبة دي. و في الحالات دي، بيكون من الجيد جدا إنك تحسس الموظف القديم أو اللي سنه كبير إنك بتستفيد من خبرته الطويلة في مجال العمل."
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "يعني ممكن برضو تستعمل معاه الأسئلة المفتوحة و تسأله عن رأيه في حاجات في الشغل و تخليه يقول إقتراحات و تاخدها فعلا بعين الإعتبار"
            },
            {
                "viewIndex": 5,
                "paragraphDetails": "و أفضل حاجة تعملها فعلا مع الناس دي لو كويسة و عندها خبرة هي التفويض. موضوع التفويض ده قائم على إسناد مهام للموظف و ترك المساحة ليه لإتخاذ القرار ثم يتحمل مسئولية الحاجات اللي عملها زي ما بيحصل معاك بالظبط متخليش الموظف القديم أو اللي سنه كبير يبقى عقبة في طريقك تعامل معاه عادي و إستعمل معاه الوسائل اللي ذكرناها لو اضطريت. و طبعا أفضل حاجة لو  وجهته كويس و بقيت تقدر تفوض له جزء أو كل العمل في حالة غيابك."
            }
        ]
    },
    {
        "videoId": 11,
        "video_title": "Coaching When Someone Is Passed Over For Promotion",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "الموظف ده بيبقى صعب لأنه شايف أصلا إنه أحق منك بالمكان ده و إن المفروض هو اللي كان يبقى قاعد مكانك بيوجهك مش بس كده، هو كمان ممكن يحس إنه فاشل و إن إنت السبب في فشله و كمان كل ما بيشوفك بتفكره بفشله افتكر كده إنت نفسك، أكيد حصلت لك على الأقل مرة في تاريخك المهني إنك إتأخرت في الترقية، أنا شخصيا حصلت لي كذا مرة و مش هنسى أول مرة بالذات لأني حسيت ساعتها بالفشل و أخذت فترة لغاية ما استعدت حماسي للعمل طيب هتعمل إيه مع الموظف ده؟ شوف الحوار ده"
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "إزيك يا فلان، أنا شايف نتايجك في تحسن و في عملاء جداد دخلوا بإسمك السنة دي و بيرد الموظف فعلا، أنا لو كملت كده هعمل رقم قياسي و متوقع ريفيو كويس الكوارتر ده"
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "هايل، أنا عارف إنك كنت متوقع الترقية و كنت متوقعها بسرعة و الموضوع لسة مخلصش لأن في فرص كتيرة هتفتح قريب في الشركة فغالبا هيرد رد شبه إيجابي أو على الأقل مش سلبي، زي مثلا أيوة، أنا كنت شايف إني حقي أترقى."
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "تمام، كل واحد ليه مكان حسب ظروفه و ظروف المكان نفسه، يعني ممكن يكون ليك مكان أفضل من اللي انت نفسك كنت عاوزه و علشان كده أنا عاوزك تستمر في أدائك الرائع مع العملاء و نشتغل مع بعض على شوية حاجات ممكن تحسن وضعك في الشركة بشكل ملحوظ لو تعاوننا مع بعض ممكن نحقق حاجات كتير هتفرق في مستقبلك بشكل إيجابي أسرع مما تكون إنت نفسك متخيل."
            },
            {
                "viewIndex": 5,
                "paragraphDetails": "و هكذا، حاول دايما إنك تحافظ على لغة إيجابية في الحوار حتى لو كنت إنت صاحب فكرة تأجيل ترقية الموظف ده بسبب رؤيتك إنه لسة مش مستعد و حتى لو مكانتش ردوده عليك بالإيجابية اللي إنت متوقعها منه أو منها."
            }
        ]
    },
    {
        "videoId": 12,
        "video_title": "Coaching Someone Who Has Been Promoted",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "بعد المثال الصعب اللي فات ده، خلينا ناخد مثال دمه خفيف شوية والجو فيه أكثر إيجابية وأسهل في التعامل."
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "لما الموظف بيكون لسة مترقي بيبقى في أكثر حالات الحماس وفي أعلى إستعداد لتلقي التوجيه وبتبقى دي فرصتك إنك تبني الموظف على الشكل اللي إنت عاوز تعمله وتستغل طموحه لفايدته وفايدة الشركة."
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "الموظف ده بيتم توجيهه بشكل مباشر والحوار معاه بيكون سهل وأقل حساسية من الأنواع التانية لأنك هنا تخلصت من أكبر عائق اللي هو مقاومة التغيير التشينج ريزيستانس"
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "أهم حاجة بس إنك تحافظ على ثقة الموظف في نفسه لأنه لسة جديد ومحتاج يثبت لنفسه إنه قد المسئولية الجديدة. ودورك أنت إنك تساعده يكبر ويملأ مكانه الجديد ويحس إنه نجم."
            }
        ]
    },
    {
        "videoId": 13,
        "video_title": "Coaching Someone Who Didn'T Get Enough Training",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "لما بيجيلك موظف مش متدرب على شغله بالشكل الكافي، بيحصل لك شوية إحباط في الأول لغاية ما تقدر تديهم الحد الأدنى المطلوب لأداء الوظيفة المطلوبة منهم. يعني مثلا لما يكون الموظف معندوش أو معندهاش مثلا مهارات البرامج البسيطة زي مايكروسوفت أوفيس أو برامج السي آر إم أو الإي آر بي الخاصة بالمخازن والحسابات أو يكون الموظف في قسم المبيعات و مأخدش تريننج حتى على خطوات الزيارة البيعية أو إزاي يعمل مكالمة تليفون بيعية لعميل جديد أو يكون محاسب و مش بيعرف إزاي يدخل فاتورة على سيستم الحسابات بتاع الشركة و هكذا"
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "مش عاوزك تتخض خالص من الحالة دي، بالعكس الموظف ده توجيهه سهل و يعتبر فرصة كويسة ليك لبناء عضو في الفريق عنده الولاء ليك و للشركة و كمان هيتعلم صح من غير أحكام مسبقة و الأهم من كل ده إن الموظف ده بيكون معندوش أي مقاومة للتغيير، و كمان بيبقى هو نفسه محتاج التغيير ده لأنه تغيير إيجابي في حياته المهنية الموظف ده إنت محتاج تشتغل معاه على حاجتين، حاجة سلوكية و حاجة في تكنيك الشغل نفسه."
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "سلوكياً، و ده الأصعب و الأهم برضه إنت محتاج تحمسه للتعلم و تخلي ثقته في نفسه عالية بالتشجيع المستمر، لأن الحاجة الوحيدة اللي ممكن تضيع منك الموظف ده هي إنه يكون محبط للدرجة اللي تخليه ميتعلمش و يفشل في مكانه في الفريق و تبقى إنت خسرت شخص كان ممكن يكون عضو إيجابي و فعال جدا في الفريق وهو يخسر فرصة كان ممكن يتعلم فيها كويس و ينمو في وظيفته."
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "أما وظيفيا، ببساطة هتعلمه المهارة المطلوبة منه لأداء الوظيفة. يعني لو مثلا بيشتغل في المبيعات، هتنزل معاه زيارات بيعية و تعلمه إزاي يمشي على خطوات الزيارة و بعدها تخليه هو يعمل نفس الكلام قدامك أو لو في الحسابات، هتعلمه إزاي يستخدم سيستم الحسابات الخاص بالشركة و إزاي يحضر تقاريره و هكذا. أهم حاجة في الموضوع إنك تشجعه بإستمرار كل ما يتعلم حاجة مهما كانت صغيرة و حاول إنك تتجنب أي نقد سلبي لأن الموظف ده بشوية تشجيع و صبر بسيط، هيكون من أكثر الناس اللي ممكن تعتمد عليها في شغلك و هتبني معاه علاقة عمل كويسة جدا بأقل مجهود."
            }
        ]
    },
    {
        "videoId": 14,
        "video_title": "Coaching Someone Who Makes Excuses",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "تعالوا بقى ناخد شوية سيناريوهات صعبة شوية. أكيد كلنا قابلنا و عانينا من الناس اللي دايما تقول جمل زي مش غلطتي أو الغلط مش عندي أو الظروف هي اللي أدت لكذا و كذا و دول الناس اللي دايما عندهم أعذار و المثل الأمريكي بيقول هؤلاء الذين يجيدون الأعذار، لا يجيدون شيئاً آخر خليني أقول لك الحاجة اللي محدش هقولهالك السر هنا مش إزاي ترد على الأعذار بتاعت الشخص اللي طول النهار بيقول أعذار، إنما الشطارة إنك تقضي على العادة السيئة بتاعت الأعذار دي نهائيا وتريح نفسك وتريح الموظف منها تماما."
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "خليني اشارك معاكم تجربتي الشخصية في الموضوع ده. كان عندي مدير مبيعات ماسك إقليم معين مكون من كذا بلد و لازم يبعت لي أسبوعيا تقرير معين عن المبيعات و يحول فيه الأرقام من جميع العملات بتاعت البلاد دي للدولار ويحطهم في تقرير موحد كان الشخص ده دايما يتأخر عن بقية الزملاء المديرين ويعطل إرسال التقرير ده، وطبعا ده كان بيعطلني أنا كمان عن إرسال تقريري النهائي لرئيس مجلس الإدارة اللي هو مديري أول مرة اتكلمت معاه بحسن نية وكنت لسة بتعرف على الفريق، فكان رده على إن الموزعين بتوع البلاد دي بيأخروا عليه تقارير الأرقام الخاصة بيهم وبالتالي هو كمان بيتأخر علي و للأسف ساعتها قعدت أكثر من ساعة معاه على التليفون أناقشه و أساعده إنه إزاي يخلي الفريق بتاعه يلتزم بإرسال التقارير."
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "ولما اتكرر الموضوع ده كذا مرة تاني، قررت إني مأدخلش معاه في تفاصيل، ولكن أناقشه في العادة السيئة دي نفسها و في توابعها على العمل و علينا. فقلت له وبهدوء شديد وبدون أي إنفعال، إن تأخير التقرير الأسبوعي بدأ يثير دهشة مجلس الإدارة لأن كل الناس في كل حتة في العالم بتبعت أرقامها كل يوم إثنين ماعدا الفريق بتاعنا فبدأ كالعادة يقول لي الأعذار وحرفيا قال لي المرة دي أكثر من ٥ أعذار فقلت له إن التقارير في النهاية برضو مخلصتش ومعرفتي للأعذار لم تغير من الأمر شيء فبدأ يعيد الأعذار مرة تانية، فرديت عليه نفس الرد مرة تانية وقلت له إنه لما يكون عنده سبب للتأخير لازم يقول لي قبلها مش بعد ما يتأخر و يسبب الحرج للفريق. الأسبوع اللي بعده بعت التقارير في موعدها بس بعدها في أسبوع بدأ في نفس السلوك السيئ اضطريت في الحالة دي إني أقول له إني هبعت التقارير في موعدها"
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "و لو إتأخر علي فأنا مضطر لإرسال الجزء بتاعه فاضي يعني الكمبيوتر هيقراه صفر و من بعدها تم الإنتظام في إرسال التقارير لغاية آخر يوم اشتغلنا فيه مع بعض أنا عارف إن ده يبدو قاسي و حاد و لكن ساعات هتضطر إنك تعمل حاجات زي كده عشان ترسي قواعد معينة للفريق بتاعك. أهم حاجة عاوزك تلاحظها هنا، إني تعاملت مع الموقف بهدوء و كان الهجوم دائما على المشكلة مش على الشخص نفسه و لكن مع الحزم و طبعا تجاهلت الأعذار و ركزت على العادة السيئة اللي عاوزين نغيرها للأبد."
            }
        ]
    },
    {
        "videoId": 15,
        "video_title": "Coaching Someone Who Doesn'T Want To Be Coached",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "طبعا إحنا عمالين نصعد لمستويات أعلى وأصعب كل ما بنتقدم في الكورس تعالوا نتكلم في حالة فعلا صعبة لما يكون عندك موظف مش بيتقبل أصلا التوجيه و ده طبعا بيحصل، بالذات لما تكون ورثت الفريق بتاعك بكل أعضاؤه، الكويس منهم و الوحش أو لأن الموظف جاي من ثقافة لا تتقبل النقد أو الإرشاد من حد. في الحالة دي، اوعى تقع في الفخ لأن الموظف ده ممكن يبقى مصدر إزعاج ليك و مصدر طاقة سلبية للفريق وممكن كمان ياخد من وقتك أكتر من حقه و بالتالي يعطلك عن توجيه بقية الفريق و عن بقية أعمالك كمدير و موظف في المكان ده طيب تعمل إيه مع النوع ده؟"
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "عشان تبني علاقة توجيهية ناجحة، إنت محتاج تظهر نفسك كشخص يقدر الموظف ده إنه يثق فيه. بدل ما تقول له بشكل مباشر إنك مديره و هتوجهه و لازم يسمع كلامك، هتعمل حاجة تانية خالص، هتساعده في حاجة صغيرة في حياته. مثلا إنت شايفه بيشتغل على إكسل و بيدخل أرقام، قول له هوريك حاجة ظريفة، و إعمل له حاجة صغيرة تسهل الموضوع معادلة مثلا أو كوندشنال فورماتنج و هكذا. غالبا هتلاقيه بعديها بيطلب مساعدتك في الموضوع لما عرف إنك شاطر فيه."
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "المرة اللي بعدها قول له إنت رايح للعميل الفلاني قريب؟ و إختار مثلا عميل هو محتاج حد يساعده و ينزل معاه يحل مشكلة مثلا و هكذا هتلاقي العلاقة بينكم أحسن بكتير و هتلاقي الشخص ده بيثق فيك و هو اللي عاوز منك التوجيه مهما كانت طبيعته لأنه لقى منك فايدة في تطوير حياته حتى و إن كان رافضك في الأول."
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "توجيه موظف نرجسي عنده شعور بالأنا أو الإيجو طيب تعالوا ناخد بقى نوع على مستوى أعلى وأصعب كمان الشخص اللي عنده إحساس كبير بالأنا أو الإيجو اللي بنسميه الشخص الإيجوتستك أو النارسيسيست. الشخص ده على فكرة مش أصعب شخص في التوجيه و لكنه برضه مش سهل لغاية ما تعرف مفاتيحه عشان فعلا تعرف تعمل له كوتشنج مظبوط سواء كان أداؤه عالي أو حتى لو كان أداؤه سيئ. التحدي هنا هو إن الشخص ذو الأنا العالية، مش من السهل إنه  يعترف بعيوبه و دي نقطة خطيرة لأن أول خطوة نحو العلاج هي الإعتراف أصلا بالمرض. بس فيه أخبار كويسة هنا، لأن في طريقة تانية للعلاج من غير ما الشخص يحس بتنفع جدا مع النوع ده من الأشخاص. أنت محتاج 3 صفات و أنت تتعامل مع النوع ده وهم  الصبر والهدوء و قوة الملاحظة"
            },
            {
                "viewIndex": 5,
                "paragraphDetails": "الصبر عشان المرحلة الأولى هتاخد وقت و هي إنك تفضل فترة توجه النقد بتاعك نحو الإيجابيات اللي الموظف بيعملها و متجيش ناحية الحاجات الي عاوز تحسنها دلوقت."
            },
            {
                "viewIndex": 6,
                "paragraphDetails": "ثم الهدوء لأنك محتاج تتحمل أي شيء بيستفزك من الشخص ده و تعذره لأنه فعلا مايقصدش، دي طبيعته و قوة الملاحظة عشان حاجتين."
            },
            {
                "viewIndex": 7,
                "paragraphDetails": "أولا لأنك لازم تحاول تلاحظ حاجات كويسة بيعملها الموظف حتى لو كان أداؤه سيء في الوقت الحالي"
            },
            {
                "viewIndex": 8,
                "paragraphDetails": "و ثانيا عشان محتاج تكتب ملاحظاتك عن الشخص و تشوف رد فعله لتوجيهاتك الإيجابية بالتدريج. بعد ما تعدي المرحلة دي، إبدأ في التوجيه نحو الأشياء اللي أنت غير راضي عنها و لكن على هيئة إنك بتعتبرها استثناءات عند الشخص ده و إن تحسينها هيخليه أفضل حتى و إن كان هو أصلا شخص كويس جدا و الطريقة دي بتنفع مع النوع ده من الناس لأنهم رغم شعورهم الشديد بنفسهم إلا إنهم أيضا بيبقوا عاوزين يبقوا دائما أفضل من أي حد. يعني إنت هتستعمل سلاح الإيجو ضد الإيجو نفسه."
            },
            {
                "viewIndex": 9,
                "paragraphDetails": "توجيه موظف سيء الأداء لما بتوجه موظف سيء الأداء، أصعب حاجة بتبقى البداية. كالعادة، بنحاول ندور على حاجة كويسة الأول. الكفاءة ، على سبيل المثال ، بتأثر على حاجات كتير، يعني لو الموظف شاطر بس في تقصير منه مستخسر مجهوده مثلا، ده محتاج إنك تكلمه عن تاريخه و إزاي كل الناس تشهد بكفاءته و تبدأ تسأله أسئلة مفتوحة عن سبب تدهور أداؤه و تكون محدد بأمثلة محددة ومقابل مقاييس و أرقام محددة و ممكن تستخدم الجرو موديل أو أي موديل في مقاييس واضحة زي أوسكار أو بي بي إيه. المواجهة مطلوبة جدا و لكن بشكل إيجابي. و بصراحة شديدة، لو الموظف مستجابش، هتضطر تاخد إجراءات أكثر حزما. ممكن توصل للتحذير المباشر أو التحذير المكتوب و لكن أهم حاجة يكون بناء على حقائق و ليس أحكام أو آراء أو وجهات نظر من ناحيتك التوجيه دايما لازم يكون بحقايق، سواء الموظف أداؤه مرتفع أو منخفض"
            }
        ]
    },
    {
        "videoId": 16,
        "video_title": "Coaching Someone Who Is A Bad Communicator",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "لما بتكون شاطر في حاجة، إزاي تعلمها لفريقك؟ المديرين اللي بيحبوا التوجيه و التدريب غالبا بيكونوا شاطرين في التواصل و الكلام. موضوع التواصل ده موضوع كبير و مش هنخوض فيه هنا بالتفصيل لأن ده كورس لوحده أو مجموعة كورسات كمان و لكن النقطة اللي عاوزين نستوعبها كويس هي إن التواصل السيء مش بالضرورة معناه إن الموظف سيئ بالعكس، ففي خلال حياتي المهنية معظم الناس اللي قابلتهم و مش شاطرين قوي في الكلام كانوا شاطرين جدا في شغلهم. أيا كان الشخص ده فهو بالإضافة لنقطة التواصل اللي محتاجة توجيه وتدريب هتلاقيه بيقع في منطقة من المناطق اللي اتكلمنا عنها في الأمثلة السابقة كل اللي انت هتعمله انك هتتعامل مع المنطقة دي زي أي حاجة عاوز تعلمها لأي فرد من أفراد فريقك"
            },
            {
                "viewIndex": 2,
                "paragraphDetails": "يعني مثلا، لو الشخص ده لسة مترقي جديد هتستعمل معاه نفس الأسلوب اللي قلنا عليه بتاع التشجيع و لو الشخص ده مش بيحب النقد، فهتستعمل معاه نفس أسلوب المساعدة في حاجات صغيرة تدريجيا. يعني مثلا تقول له إيه رأيك لما تتصل بعميل في التليفون، تقول له كذا و كذا بدلا من كذا و كذا، أنا جربتها و فرقت معايا كتير في شغلي. إلخ"
            },
            {
                "viewIndex": 3,
                "paragraphDetails": "ببساطة، كلنا عندنا حاجات كتير نتعلمها في موضوع التواصل أو الكوميونيكيشن ده و الحتة دي بالذات، مفيهاش حد كامل."
            },
            {
                "viewIndex": 4,
                "paragraphDetails": "توجيه موظف يكرر نفس الأخطاء مفيش حد فينا مبيعملش أخطاء، وغالبا بيكررها مرة واتنين لحد ما يتعلم منها، ولو قابلت النوع ده في بيئة العمل فسهل جدا توجهه وتعمله الـ coaching المناسب كل اللي أنت محتاجه انك تقسيم المهارة اللي عاوز تعلمها له لحتت صغيرة و تعلمه كل حتة لوحدها. بس كده"
            },
            {
                "viewIndex": 5,
                "paragraphDetails": "يعني مثلا، لو هو مراجع حسابات، علمه إزاي يحسب فواتير المبيعات و يفصل الضريبة و بس. و بعد ما يتقن الموضوع ده تماما، علمه إزاي يقرأ فواتير الموردين و يفصل الضريبة و بعد كده علمه إزاي يفرق بين فواتير موردين المبيعات و موردين الأصول الثابتة وبعدين إزاي يحط كل حاجة في الحتة المخصوصة ليها في قايمة الدخل. وبعدين إزاي يدخل نفس الكلام في قايمة التدفقات المالية. و هكذا لغاية ما الأخطاء تقل."
            },
            {
                "viewIndex": 6,
                "paragraphDetails": "كلمة السر هنا هي الصبر يعني متنقلش من مهارة للتانية لغاية ما تتأكد إن الموظف بقى ١٠٠٪ في المهارة الأولانية  و بعد كل جزء جديد تعلمهوله، لازم تجمعه مع الجزء اللي قبله و تربط ما بينهم قبل ما تخش على الجزء اللي بعده. و تعمل ده في كل مرحلة. دايما أسهل حاجة لتعلم مهارة أو حتى معلومة معينة، هي انك تقسمها لحتت صغيرة سهلة و وبعدين تجمعها و تربط ما بين الحتت دي"
            }
        ]
    },
    {
        "videoId": 17,
        "video_title": "Conclusion Art Of Coaching",
        "paragraphInfo": [
            {
                "viewIndex": 1,
                "paragraphDetails": "تبنى و نشر ثقافة الـ coaching و تشجيع المديرين على توجيه موظفينهم، بيؤدي إلى نتايج ملموسة و واضحة، مش بس في تحسين أداء الموظفين أو المديرين أو حتى تحسين أداء الشركة و زيادة إنتاجيتها، و لكن كمان حسنت علاقات الفريق ببعضهم  و المدير مع الفريق ومع الأقسام و القطاعات المختلفة مع بعض والتوجيه المستمر له أثر فعال على الموظفين لتحسين أدوارهم الحالية و كمان عشان تقدمهم الوظيفي و تسريع عملية اكتساب المهارات. وفى نهاية الكورس ده، أنا عاوزك تستثمر وقتك في تطبيق المهارات اللي اتعلمتها و الموديلز اللي اتكلمنا عنها و تدرس الأنواع المختلفة من الشخصيات اللي اتكلمنا عليها و كمان بعد كده تقارن و تشوف مين من فريقك بيشبه أي نوع من أنواع الموظفين دول و تطبق الطرق اللي اتعلمتها عشان تعرف توجه الموظفين دول بالشكل اللي ينفع معاهم. و الشكل اللي يوصلهم و يوصلك لأعلى درجات النجاح شكرا ليكم على  متابعة الكورس و أتمنى ليكم و لكل زملائكم و موظفينكم و لشركاتكم النجاح و التوفيق في العمل و في الحياة."
            }
        ]
    }
]